{
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_ids": 0,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "License Agreement",
    "1": "Employment Agreement",
    "2": "Non-Disclosure Agreement",
    "3": "Vendor Agreement",
    "4": "Loan Agreement",
    "5": "Partnership Agreement",
    "6": "Consulting Agreement",
    "7": "Service Level Agreement",
    "8": "Franchise Agreement",
    "9": "Lease Agreement"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Consulting Agreement": 6,
    "Employment Agreement": 1,
    "Franchise Agreement": 8,
    "Lease Agreement": 9,
    "License Agreement": 0,
    "Loan Agreement": 4,
    "Non-Disclosure Agreement": 2,
    "Partnership Agreement": 5,
    "Service Level Agreement": 7,
    "Vendor Agreement": 3
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.55.4",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
